{
    "brand": "Acer",
    "name": "2018 Newest Acer 14-inch HD Chromebook LED Anti-glare Display, Intel Dual-Core Celeron 3855u 1.6GHz processor, 4GB RAM, 16GB SSD, HDMI, USB 3.0, Webcam, 802.11a Wifi, Bluetooth, Google Chrome OS",
    "price": "$229.00",
    "img-url": "https://images-na.ssl-images-amazon.com/images/I/41nlp137qeL._SX300_QL70_.jpg",
    "star-rating": "4.2 out of 5 stars",
    "customer-reviews-count": "79 customer reviews",
    "details": [
        "14\" Anti-Glare HD WLED Backlit (1366x768) Display with Acer ComfyView Technology, Built-in media reader",
        "Intel dual-core Skylake Celeron 3855U 1.60 GHz processor 2M Cache, Intel HD Graphics 510, Built-in HD webcam with microphone",
        "4GB LPDDR3 Memory, 16 GB eMMC Flash Memory, Built-in cloud support-easily save your files to your Google Drive account for secure access wherever you go",
        "High Speed 802.11a WiFi, Bluetooth, HDMI, 2x USB 3.0, 1x USB 3.1 Type-C, 1 x Headphone/Microphone Combo Jack",
        "Google Chrome OS, Up to 10 hours Battery life, Color: Black"
    ],
    "short-reviews": [
        "Best  and safer computer to surf the Web and Watch Videos of all kinds.",
        "... only had this for a couple days but I love it. I went from a macbook to this ...",
        "Great for school work....and Netflix",
        "This is NOT a 2018 Newest Acer - manufacture date is 08/2016",
        "AWESOME PRODUCT...SIMPLE TO USE",
        "I love this laptop",
        "... it is the biggest screen - Mom seems to love it.",
        "easy to use"
    ],
    "long-reviews": [
        "I already have an 11.5\"  Acer Chromebook, bought few years ago and based on the success of this first one, I decided to go ahead and buy another one of a larger size.  I just LOVE, LOVE my two Acer Chromebooks.  In the past I made the mistake of buying regular Microsoft Windows type of computer, and few of them still have at home, but after discovering the Acer Chromebook, I must say, I wish I knew earlier about the superiority of a Chromebook over a Windows, Microsoft product....I do not want to open a Microsoft Windows type of computer war vs an Acer Chromebook here....I am just saying...if you are happy with your Microsoft Windows product, I am not criticizing your purchase, what I am saying is that having both products at home...I Love the the simplicity of the Acer Chromebook over the \"OTHERS\"....I am fully aware that a Microsoft Windows type of computer can do other things that a Chromebook cannot do, but if you are just surfing the web and consuming much web media, Facebook, or Yahoo Mail, YouTube, Netflix....Nothing beats the Acer Chromebook for reliability and speed.  Acer Chromebook turns on at the speed of light, and no viruses of any kind to worry about.  Also, it does not slow down when updating the system like Microsoft Windows constantly does....Yes,  at 15.6 inches screen, it is indeed a little jewel adn the price was very good....Thank You Amazon.  And Thank You ACER.",
        "I have only had this for a couple days but I love it.  I went from a macbook to this and expected to be disappointed.  I didn't have to adjust any of the settings or anything with this laptop.  I logged into my gmail and everything was perfect.  So far I have no complaints.  I can't believe how inexpensive it was.",
        "Had it for over a month now. It's fast, easy-to-use machine with a large screen. Bought it for my daughter to use for homework. Our school, like many use Google Docs for much of the work that is done online. A chromebook is all they need - no need for Microsoft! Of course my daughter likes the large screen for watching Netflix when the homework is completed!",
        "NOT a 2018 Chromebook as stated in the title.  I was expecting a Chromebook manufactured in late 2017 or 2018.  This particular Chromebook was manufactured in August of 2016.  Very misleading title......definitely not the \"2018 Newest\".  The Chromebook does seem to be pretty decent though.",
        "I was tired of Windows 10 faulty updates, and needed a reliable computer.  The Acer was recommended to me by several friends.  I got it last week and love it.  Easy to set up and understand, no heat from hard drive, quick, less hassle, nice quality, etc.  I still have my Dell with Windows 10, but for right now this Acer Chromebook is my first choice.  It takes a little while getting used to a keyboard with fewer keys, and more closely spaced together, but I have no other qualms about this Chromebook.  I am learning more about the Chromebook daily, and appreciate its simplicity and no need for added security.  Excellent value, and performance.  I was pleased with the Acer's price and features.  Easy to hook up to Ethernet with adapter if needed.",
        "I love this laptop! While I am used to Macbooks, my beloved recently died. I was not on the market for another macbook (not by choice) and needed a new laptop quick. I did some quick research and saw good reviews on this laptop. I ordered on Amazon prime and received within 3 days. I'm impressed! Chomebook has made my life extremely easy. Everything is connected! Something about the keyboard makes it easy to type. I LOVE IT!",
        "A little heavy but it is the biggest screen - Mom seems to love it... no more desktop screen clutter... Thanks",
        "bought for an elderly relative.  easy to use!"
    ]
}